Add latest changes from gitlab-org/gitlab@master
